#!/bin/bash

# запази първия подаден параметър в нова променлива с име ВХОДНО_ИЗОБРАЖЕНИЕ, за да е по-ясно за какво служи
INPUT_IMAGE=$1
# запази втория подаден параметър в нова променлива с име ИЗХОДНО_ИЗОБРАЖЕНИЕ, за да е по-ясно за какво служи
OUTPUT_IMAGE=$2
# отдели само името на файла, без разширението
FILENAME=${INPUT_IMAGE%%.*}
# вземи ширината на изображението и я запази в нова променлива, за да можем да я ползваме по-късно
WIDTH=$(convert $INPUT_IMAGE -ping -format "%w" info:)
# вземи височината на изображението и я запази в нова променлива, за да можем да я ползваме по-късно
HEIGHT=$(convert $INPUT_IMAGE -ping -format "%h" info:)

# провери дали ширината е равна на височината
if [ $WIDTH -eq $HEIGHT ]; then
  # ако влезем тук, значи ширината е равна на височината
  # зареди изображението с името, което сме получили при извикването на този скрипт
  # промени ширината и височината му на 200 пиксела
  # запиши го с името, което получаваме при извикване на този скрипт
  convert $INPUT_IMAGE -resize 200x200 $OUTPUT_IMAGE
elif [ $WIDTH -lt $HEIGHT ]; then
  # ако влезем тук, значи ширината е по-малка от височината
  # зареди изображението
  # промени ширината му на 200 пиксела
  # определи височината така, че съотношението ширина/височина да се запази, за да не се разтегли изображението
  # направи го квадратно, като изрежеш излишната долна част на правоъгълника
  # запиши го
  convert $INPUT_IMAGE -resize 200 -crop 200x200+0+0 $OUTPUT_IMAGE
else
  # ако влезем тук, значи ширината е по-голяма от височината
  # зареди изображението
  # промени височината му на 200 пиксела
  # определи ширината така, че съотношението ширина/височина да се запази
  # направи го квадратно, като изрежеш равно пространство и от двете страни
  # запиши го
  convert $INPUT_IMAGE -resize x200 -gravity center -crop 200x200+0+0 $OUTPUT_IMAGE
fi

# изведи съобщение за успех
echo "УСПЕХ: $INPUT_IMAGE беше преобразувано"
